# ENERGY

In [ ]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_ind

In [ ]:
# Use this dictionary to map state names to two letter acronyms
states = {'OH': 'Ohio', 'KY': 'Kentucky', 'AS': 'American Samoa', 'NV': 'Nevada', 'WY': 'Wyoming', 'NA': 'National', 'AL': 'Alabama', 'MD': 'Maryland', 'AK': 'Alaska', 'UT': 'Utah', 'OR': 'Oregon', 'MT': 'Montana', 'IL': 'Illinois', 'TN': 'Tennessee', 'DC': 'District of Columbia', 'VT': 'Vermont', 'ID': 'Idaho', 'AR': 'Arkansas', 'ME': 'Maine', 'WA': 'Washington', 'HI': 'Hawaii', 'WI': 'Wisconsin', 'MI': 'Michigan', 'IN': 'Indiana', 'NJ': 'New Jersey', 'AZ': 'Arizona', 'GU': 'Guam', 'MS': 'Mississippi', 'PR': 'Puerto Rico', 'NC': 'North Carolina', 'TX': 'Texas', 'SD': 'South Dakota', 'MP': 'Northern Mariana Islands', 'IA': 'Iowa', 'MO': 'Missouri', 'CT': 'Connecticut', 'WV': 'West Virginia', 'SC': 'South Carolina', 'LA': 'Louisiana', 'KS': 'Kansas', 'NY': 'New York', 'NE': 'Nebraska', 'OK': 'Oklahoma', 'FL': 'Florida', 'CA': 'California', 'CO': 'Colorado', 'PA': 'Pennsylvania', 'DE': 'Delaware', 'NM': 'New Mexico', 'RI': 'Rhode Island', 'MN': 'Minnesota', 'VI': 'Virgin Islands', 'NH': 'New Hampshire', 'MA': 'Massachusetts', 'GA': 'Georgia', 'ND': 'North Dakota', 'VA': 'Virginia'}

In [ ]:
def get_list_of_university_towns():
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )
    
    The following cleaning needs to be done:

    1. For "State", removing characters from "[" to the end.
    2. For "RegionName", when applicable, removing every character from " (" to the end.
    3. Depending on how you read the data, you may need to remove newline character '\n'. '''
    townslist1='/content/drive/My Drive/Coursera Michigan Python/university_towns.txt'
    univeristy_towns=[]
    states=[]
    withopen(townslist1) as file:
      for line in file:
        if '[edit]' in line:
          states.append(line)

    
    return "ANSWER"

In [ ]:
townslist1='/content/drive/My Drive/Coursera Michigan Python/university_towns.txt'

In [ ]:
with open(townslist1) as file:
  for line in file:
    print(line)

OSError: ignored

# Method 1.
## Step 1. Make two lists,1-one with edit key word,2-Without edit keyword

In [ ]:
university_towns2 = []
states2=[]
with open(townslist1) as file:
  for line in file:
    if '[edit]' in line:
 # Remember this `state` until the next is found
      states2.append(line)
    else:
# Otherwise, we have a city; keep `state` as last-seen
      university_towns2.append(line)

In [ ]:
''' university_towns1 = []
with open(townslist1) as file:
  for line in file:
    if '[edit]' in line:
 # Remember this `state` until the next is found
      state = line
    else:
# Otherwise, we have a city; keep `state` as last-seen
      university_towns1.append((state, line))

In [ ]:
university_towns21[:3]

[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n')]

In [ ]:
states2=states2[:5]

['Alabama[edit]\n',
 'Alaska[edit]\n',
 'Arizona[edit]\n',
 'Arkansas[edit]\n',
 'California[edit]\n']

## Combine them to zip form and make a dataframe

In [ ]:
zipped_list=zip(states2,university_towns2)

In [ ]:
towns_df=pd.DataFrame(zipped_list,columns=['State', 'RegionName'])

In [ ]:
towns_df.head()

                State                                         RegionName
0     Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1      Alaska[edit]\n           Florence (University of North Alabama)\n
2     Arizona[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3    Arkansas[edit]\n       Livingston (University of West Alabama)[2]\n
4  California[edit]\n         Montevallo (University of Montevallo)[2]\n

## Step Make a function that 1-Finds first ( and returns whats is before '("
## 2-Finds first [ and returns whats is before that only
#### Finally apply this function to each column and the required result is found

In [ ]:
import numpy as np

In [ ]:
def get_citystate(item):
  if '(' in item:
      return item[:item.find('(')]
  elif '[' in item:
      return item[:item.find('[')]
  else:
      return item

In [ ]:
towns_df['State']=towns_df['State'].apply(get_citystate)
towns_df.head()

        State                                         RegionName
0     Alabama                    Auburn (Auburn University)[1]\n
1      Alaska           Florence (University of North Alabama)\n
2     Arizona  Jacksonville (Jacksonville State University)[2]\n
3    Arkansas       Livingston (University of West Alabama)[2]\n
4  California         Montevallo (University of Montevallo)[2]\n

In [ ]:
import re

In [ ]:
towns_df['RegionName']=towns_df['RegionName'].apply(get_citystate)

In [ ]:
towns_df.head()

        State  RegionName
0     Alabama     Alabama
1      Alaska      Alaska
2     Arizona     Arizona
3    Arkansas    Arkansas
4  California  California

## Combining all this in a Single method

In [ ]:
def get_list_of_university_towns():
    townslist1='/content/drive/My Drive/Coursera Michigan Python/university_towns.txt'
    university_towns2 = []
    states2=[]
    with open(townslist1) as file:
      for line in file:
        if '[edit]' in line:
    # Remember this `state` until the next is found
          states2.append(line)
        else:
    # Otherwise, we have a city; keep `state` as last-seen
          university_towns2.append(line)
    zipped_list=zip(states2,university_towns2)
    towns_df=pd.DataFrame(zipped_list,columns=['State', 'RegionName'])
    def get_citystate(item):
      if '(' in item:
          return item[:item.find('(')]
      elif '[' in item:
          return item[:item.find('[')]
      else:
          return item
    towns_df['State']=towns_df['State'].apply(get_citystate)
    towns_df['RegionName']=towns_df['RegionName'].apply(get_citystate)
         
    
    return towns_df

In [ ]:
get_list_of_university_towns().head()

        State     RegionName
0     Alabama        Auburn
1      Alaska      Florence
2     Arizona  Jacksonville
3    Arkansas    Livingston
4  California    Montevallo

# Question 2
# The starting year when the GDP is decreasing (from the previous year)

In [ ]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    
    return "ANSWER"

In [ ]:
gdplev1='/content/drive/My Drive/Coursera Michigan Python/gdplev.xls'

# Step-1 Remove the 0,1,2,3,5 and 7 columns (4,6 left)
## Then use only the Years after 2000

In [ ]:
def get_gdp_time_series():
    '''Returns a DataFrame of GDP over time from the gdplev.xls file.'''
        
    r = (pd.read_excel(gdplev1,
                      skiprows=7)
        .drop(columns=['Unnamed: 0','Unnamed: 1','Unnamed: 2',
                       'Unnamed: 3','Unnamed: 5','Unnamed: 7'])
        .rename(columns={'Unnamed: 4':'YearQ',
                        'Unnamed: 6':'GDP'}))
    r = r[r['YearQ']>'2000']
    
    return r


# Q . Start of Recession..i.e when ['GDP'] INDEX 1 IS > index 0 and INDEX 2 is greater than INDEX 1 ..OR A>B>C

In [ ]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    
    r = get_gdp_time_series()
    
    rec_start = r[(r['GDP'] > r['GDP'].shift(-1))&
                  (r['GDP'].shift(-1) > r['GDP'].shift(-2))].copy()
    
    return rec_start.iloc[0,0]


# Q .End of Recession..i.e when ['GDP'] INDEX 1 IS < index 0 and INDEX 0 is greater than INDEX -1 ..OR A<B<C

In [ ]:
def get_recession_end():
    '''Returns the year and quarter of the recession end time as a 
    string value in a format such as 2005q3'''
    
    r = get_gdp_time_series()
    rec_start = get_recession_start()
    r = r[r['YearQ'] >= rec_start].copy()
    
    rec_end = r[(r['GDP'] > r['GDP'].shift(1))&
                (r['GDP'].shift(1) > r['GDP'].shift(2))].copy()
    
    return rec_end.iloc[0,0]

# Q The end Year  'YearQ' of recession.
Get start and end GDP dataframe from above 2 functions

In [ ]:
gdplev=pd.read_excel(gdplev1)
gdplev.head(9)

  Current-Dollar and "Real" Gross Domestic Product  ... 2016-09-29 00:00:00
0                                              NaN  ...                 NaN
1                                           Annual  ...                 NaN
2                                              NaN  ...                 NaN
3                                              NaN  ...                 NaN
4                                              NaN  ...                 NaN
5                                              NaN  ...                 NaN
6                                              NaN  ...                 NaN
7                                             1929  ...                 NaN
8                                             1930  ...                 NaN

[9 rows x 8 columns]

In [ ]:
gdplev=pd.read_excel(gdplev1,skiprows=7)
gdplev.head()

   Unnamed: 0  Unnamed: 1  Unnamed: 2  ...  Unnamed: 5 Unnamed: 6  Unnamed: 7
0      1929.0       104.6      1056.6  ...       243.1     1934.5         NaN
1      1930.0        92.2       966.7  ...       246.3     1932.3         NaN
2      1931.0        77.4       904.8  ...       250.1     1930.3         NaN
3      1932.0        59.5       788.2  ...       260.3     1960.7         NaN
4      1933.0        57.2       778.3  ...       266.2     1989.5         NaN

[5 rows x 8 columns]

In [ ]:
# drop columns 0,1,2,3,5 and 7
gdplev1=gdplev.drop(columns=['Unnamed: 0','Unnamed: 1','Unnamed: 2',
                       'Unnamed: 3','Unnamed: 5','Unnamed: 7'])
gdplev1.head()

  Unnamed: 4  Unnamed: 6
0     1947q1      1934.5
1     1947q2      1932.3
2     1947q3      1930.3
3     1947q4      1960.7
4     1948q1      1989.5

In [ ]:
gdplev1.rename(columns={'Unnamed: 4':'YearQ','Unnamed: 6': 'GDP'},inplace=True)
gdplev1.head()

    YearQ     GDP
0  1947q1  1934.5
1  1947q2  1932.3
2  1947q3  1930.3
3  1947q4  1960.7
4  1948q1  1989.5

In [ ]:
# get the dataframe after year 2000
gdplev2=gdplev1[gdplev1['YearQ']>'2000']
gdplev2.head()
print(gdplev2.shape)

(66, 2)

In [ ]:
gdplev3=gdplev1[gdplev1['YearQ']>'2000'].copy()
print(gdplev3.head(2))
print(gdplev3.shape)

      YearQ      GDP
212  2000q1  12359.1
213  2000q2  12592.5
(66, 2)

In [ ]:
gdplev3['GDP']

212    12359.1
213    12592.5
214    12607.7
215    12679.3
216    12643.3
        ...
273    16374.2
274    16454.9
275    16490.7
276    16525.0
277    16583.1
Name: GDP, Length: 66, dtype: float64

In [ ]:
gdplev3['GDP'].shift(2)

212        NaN
213        NaN
214    12359.1
215    12592.5
216    12607.7
        ...
273    16186.7
274    16269.0
275    16374.2
276    16454.9
277    16490.7
Name: GDP, Length: 66, dtype: float64

In [ ]:
def get_gdp_time_series():
    '''Returns a DataFrame of GDP over time from the gdplev.xls file.'''
        
    r = (pd.read_excel(gdplev1,
                      skiprows=7)
        .drop(columns=['Unnamed: 0','Unnamed: 1','Unnamed: 2',
                       'Unnamed: 3','Unnamed: 5','Unnamed: 7'])
        .rename(columns={'Unnamed: 4':'YearQ',
                        'Unnamed: 6':'GDP'}))
    r = r[r['YearQ']>'2000']
    
    return r

In [ ]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    
    r = get_gdp_time_series()
    
    rec_start = r[(r['GDP'] > r['GDP'].shift(-1))&
                  (r['GDP'].shift(-1) > r['GDP'].shift(-2))]
    
    return rec_start.iloc[0,0]

In [ ]:
def get_recession_end():
    '''Returns the year and quarter of the recession end time as a 
    string value in a format such as 2005q3'''
    
    r = get_gdp_time_series()
    rec_start = get_recession_start()
    r = r[r['YearQ'] >= rec_start]
    
    rec_end = r[(r['GDP'] > r['GDP'].shift(1))&
                (r['GDP'].shift(1) > r['GDP'].shift(2))]
    
    return rec_end.iloc[0,0]

In [ ]:
get_recession_end()

'2009q4'

In [ ]:
get_recession_end()

'2009q4'

## We will use ~ (not) and also add new column "Region Name" using .loc
#### We have the Region Name in the rows of the form 'Alabama[edit]'

In [ ]:
# we use .loc to make a new column


users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [ ]:
users.loc[~users['occupation'].str.contains('writer',regex=False)]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[898 rows x 4 columns]

In [ ]:
users.head()

         age gender  occupation zip_code  writer column
user_id
1         24      M  technician    85711           True
2         53      F       other    94043           True
3         23      M      writer    32067          False
4         24      M  technician    43537           True
5         33      F       other    15213           True

In [ ]:
data_url = 'http://bit.ly/2cLzoxH'
# load the gapminder dataframe from web as data frame
gapminder = pd.read_csv(data_url)
# select four columns
gapminder = gapminder[['country','year', 'gdpPercap', 'pop']]
# view few elements of the data frame
print(gapminder.head(3))

       country  year   gdpPercap         pop
0  Afghanistan  1952  779.445314   8425333.0
1  Afghanistan  1957  820.853030   9240934.0
2  Afghanistan  1962  853.100710  10267083.0

In [ ]:
# adding new columbns
gapminder.loc[:,'pop_in_millions'] = gapminder['pop']/1e06
gapminder.head(3)

       country  year   gdpPercap         pop  pop_in_millions
0  Afghanistan  1952  779.445314   8425333.0         8.425333
1  Afghanistan  1957  820.853030   9240934.0         9.240934
2  Afghanistan  1962  853.100710  10267083.0        10.267083

In [ ]:
s = pd.Series(range(-3, 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [ ]:
s[~(s > 0)]

0   -3
1   -2
2   -1
3    0
dtype: int64

## Step 1
remove the [edit]

In [ ]:
t = (pd.read_csv(townslist1,sep='/n',engine='python',header=None).rename(columns={0:'State'}))
t.head()

                                             State
0                                    Alabama[edit]
1                    Auburn (Auburn University)[1]
2           Florence (University of North Alabama)
3  Jacksonville (Jacksonville State University)[2]
4       Livingston (University of West Alabama)[2]

In [ ]:
t.loc[~t['State'].str.contains("[edit]", regex=False),'RegionName'] = t['State']
# gapminder.loc[:,'pop_in_millions'] = gapminder['pop']/1e06
t.head()

                                             State                                       RegionName
0                                    Alabama[edit]                                              NaN
1                    Auburn (Auburn University)[1]                    Auburn (Auburn University)[1]
2           Florence (University of North Alabama)           Florence (University of North Alabama)
3  Jacksonville (Jacksonville State University)[2]  Jacksonville (Jacksonville State University)[2]
4       Livingston (University of West Alabama)[2]       Livingston (University of West Alabama)[2]

In [ ]:
t.loc[t['State']==t['RegionName'],'State'] = np.nan

In [ ]:
t.head()

           State                                       RegionName
0  Alabama[edit]                                              NaN
1            NaN                    Auburn (Auburn University)[1]
2            NaN           Florence (University of North Alabama)
3            NaN  Jacksonville (Jacksonville State University)[2]
4            NaN       Livingston (University of West Alabama)[2]

In [ ]:
t['State'] = (t['State'].str.replace(r'\[.*','').fillna(method='ffill'))
t.head(12)

      State                                         RegionName
0   Alabama                                                NaN
1   Alabama                      Auburn (Auburn University)[1]
2   Alabama             Florence (University of North Alabama)
3   Alabama    Jacksonville (Jacksonville State University)[2]
4   Alabama         Livingston (University of West Alabama)[2]
5   Alabama           Montevallo (University of Montevallo)[2]
6   Alabama                          Troy (Troy University)[2]
7   Alabama  Tuscaloosa (University of Alabama, Stillman Co...
8   Alabama                  Tuskegee (Tuskegee University)[5]
9    Alaska                                                NaN
10   Alaska      Fairbanks (University of Alaska Fairbanks)[2]
11  Arizona                                                NaN

In [ ]:
t['RegionName'] = t['RegionName'].str.replace(r'\W*\(.*','')
t.head()

     State    RegionName
0  Alabama           NaN
1  Alabama        Auburn
2  Alabama      Florence
3  Alabama  Jacksonville
4  Alabama    Livingston

     State    RegionName
0  Alabama           NaN
1  Alabama        Auburn
2  Alabama      Florence
3  Alabama  Jacksonville
4  Alabama    Livingston

In [ ]:
t = t.drop(t[t['RegionName'].isna()].index)

In [ ]:
t.head()

     State    RegionName
1  Alabama        Auburn
2  Alabama      Florence
3  Alabama  Jacksonville
4  Alabama    Livingston
5  Alabama    Montevallo

In [ ]:
def get_list_of_university_towns():
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )
    
    The following cleaning needs to be done:

    1. For "State", removing characters from "[" to the end.
    2. For "RegionName", when applicable, removing every character from " (" to the end.
    3. Depending on how you read the data, you may need to remove newline character '\n'. '''
    with open(townslist1) as f:
        townslist = f.readlines()
    
    townslist = [x.rstrip() for x in townslist]
    
    townslist2 = list()
    
    for i in townslist:
        if i[-6:] == '[edit]':
            temp_state = i[:-6]
        elif '(' in i:
            town = i[:i.index('(') - 1]
            townslist2.append([temp_state, town])
        else:
            town = i
            townslist2.append([temp_state, town])

    collegedf = pd.DataFrame(townslist2, columns=['State','RegionName'])


    return collegedf

get_list_of_university_towns()

         State     RegionName
0      Alabama         Auburn
1      Alabama       Florence
2      Alabama   Jacksonville
3      Alabama     Livingston
4      Alabama     Montevallo
..         ...            ...
512  Wisconsin    River Falls
513  Wisconsin  Stevens Point
514  Wisconsin       Waukesha
515  Wisconsin     Whitewater
516    Wyoming        Laramie

[517 rows x 2 columns]

In [ ]:
import re

In [ ]:
def get_list_of_university_towns2():
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )
    
    The following cleaning needs to be done:
    1. For "State", removing characters from "[" to the end.
    2. For "RegionName", when applicable, removing every character from " (" to the end.
    3. Depending on how you read the data, you may need to remove newline character '\n'. '''
    
    
    state_region = list()
    state = ""
    infile = open(townslist1)
    for line in infile:
        #print(line,end="")
        line = line[:-1]
        is_state = re.search("^(.+)(\[edit\])$",line)
        if (is_state is not None):
            #state.append(is_state.group(1))
            state = is_state.group(1)
            #print("============State==============")
        else:
            if '(' in line:
                region = line[:line.index('(')-1]
                state_region.append([state,region])
                #print(region)
            else:
                region = line
                state_region.append([state,region])
    #print(state_region)
    df = pd.DataFrame( state_region, columns=["State", "RegionName"]  )
    return df

In [ ]:
get_list_of_university_towns2()

         State     RegionName
0      Alabama         Auburn
1      Alabama       Florence
2      Alabama   Jacksonville
3      Alabama     Livingston
4      Alabama     Montevallo
..         ...            ...
512  Wisconsin    River Falls
513  Wisconsin  Stevens Point
514  Wisconsin       Waukesha
515  Wisconsin     Whitewater
516    Wyoming        Laramie

[517 rows x 2 columns]

In [ ]:
def get_list_of_university_towns():
    
    university_towns = townslist1
    
    # Create two columns corresponding to university towns and states they are in
    university_towns['State'] = np.nan
    for town in university_towns['RegionName']:
        if re.search('(\[edit\])', town): 
            university_towns.State[university_towns.RegionName == town] = town
    university_towns['State'] = university_towns['State'].fillna(method = 'ffill')
    university_towns = university_towns[university_towns.RegionName != university_towns.State]
    university_towns = university_towns.reset_index(drop = True)
    
    # Remove redundant text
    for town in university_towns.RegionName:
        town_edited = re.sub('([\(\[:].*)', '', town).rstrip()
        university_towns.RegionName[university_towns.RegionName == town] = town_edited
    
    for state in university_towns.State:
        state_edited = re.sub('(\[.*)', '', state).rstrip()
        university_towns.State[university_towns.State == state] = state_edited
        names = ['State', 'RegionName']
        university_towns = university_towns[names]
    
    return university_towns

print(get_list_of_university_towns().head(5))

TypeError: ignored

#### Skip header and footer

In [ ]:
pd.read_excel(address1,skiprows=17,skipfooter=38).tail(39)

     Unnamed: 0  ... Unnamed: 6
188         NaN  ...        NaN
189         NaN  ...        NaN
190         NaN  ...        NaN
191         NaN  ...        NaN
192         NaN  ...        NaN
193         NaN  ...        NaN
194         NaN  ...        NaN
195         NaN  ...        NaN
196         NaN  ...        NaN
197         NaN  ...        NaN
198         NaN  ...        NaN
199         NaN  ...        NaN
200         NaN  ...        NaN
201         NaN  ...        NaN
202         NaN  ...        NaN
203         NaN  ...        NaN
204         NaN  ...        NaN
205         NaN  ...        NaN
206         NaN  ...        NaN
207         NaN  ...        NaN
208         NaN  ...        NaN
209         NaN  ...        NaN
210         NaN  ...        NaN
211         NaN  ...        NaN
212         NaN  ...        NaN
213         NaN  ...        NaN
214         NaN  ...        NaN
215         NaN  ...        NaN
216         NaN  ...        NaN
217         NaN  ...        NaN
218         NaN  ...        NaN
219         NaN  ...        NaN
220         NaN  ...        NaN
221         NaN  ...        NaN
222         NaN  ...        NaN
223         NaN  ...        NaN
224         NaN  ...        NaN
225         NaN  ...        NaN
226         NaN  ...        NaN

[39 rows x 7 columns]

In [ ]:
energy=pd.read_excel(address1,skiprows=17,skipfooter=38)

#### 2 Remove 1st 2 columns
### Vimp Dont forget the axis=1

In [ ]:
energy.head(2)

   Unnamed: 0   Unnamed: 1   Unnamed: 2  ... Gigajoules          %  Unnamed: 6
0         NaN  Afghanistan  Afghanistan  ...         10   78.66928         NaN
1         NaN      Albania      Albania  ...         35  100.00000         NaN

[2 rows x 7 columns]

In [ ]:
energy.drop(columns=['Unnamed: 0','Unnamed: 1'],axis=1,inplace=True)
# energy.drop(['Unnamed: 0','Unnamed: 1'],axis=1,inplace=True)
energy.head(2)

    Unnamed: 2 Petajoules Gigajoules          %  Unnamed: 6
0  Afghanistan        321         10   78.66928         NaN
1      Albania        102         35  100.00000         NaN

#### Rename columns {"Unnamed: 2": "Country", "Petajoules": "Energy Supply", "Gigajoules": "Energy Supply per Capita","%" : "% Renewable"}

In [ ]:
columns_dict={"Unnamed: 2": "Country", "Petajoules": "Energy Supply", "Gigajoules": "Energy Supply per Capita","%" : "% Renewable"}

In [ ]:
#Note we use RENAME and axis=1 to change columns name

energy.rename(mapper=columns_dict,axis=1,inplace=True)

In [ ]:
energy.head(3)

       Country Energy Supply Energy Supply per Capita  % Renewable  Unnamed: 6
0  Afghanistan           321                       10     78.66928         NaN
1      Albania           102                       35    100.00000         NaN
2      Algeria          1959                       51      0.55101         NaN

#### Change ['Energy Supply'] to Gigajoules *= 1000000

In [ ]:
energy['Energy Supply'] *= 1000000

#### For all countries which have missing data (e.g. data with "...") make sure this is reflected as np.NaN values.

In [ ]:
for col in energy:
  energy[col]=energy[col].replace("...",np.NaN)

#### Rename the following list ( Note : Rows)of countries (for use in later questions):

"Republic of Korea": "South Korea",
"United States of America": "United States",
"United Kingdom of Great Britain and Northern Ireland": "United Kingdom",
"China, Hong Kong Special Administrative Region": "Hong Kong"

### Imp Note to use RENAME for rows,we need to change the row to index

In [ ]:
energy.set_index('Country',inplace=True)

In [ ]:
energy.head(3)

            Energy Supply  Energy Supply per Capita  % Renewable  Unnamed: 6
Country
Afghanistan     321000000                      10.0     78.66928         NaN
Albania         102000000                      35.0    100.00000         NaN
Algeria        1959000000                      51.0      0.55101         NaN

In [ ]:
rows_dict={"Republic of Korea": "South Korea", "United States of America": "United States", "United Kingdom of Great Britain and Northern Ireland": "United Kingdom", "China, Hong Kong Special Administrative Region": "Hong Kong"}

In [ ]:
energy.rename(mapper=rows_dict,axis=0,inplace=True)

#### Check if the new name is "South Korea"

In [ ]:
energy[energy.index=='South Korea']

            Energy Supply  Energy Supply per Capita  % Renewable  Unnamed: 6
Country
South Korea   11007000000                     221.0     2.279353         NaN

#### Check "South Korea" if the Country column is not an index

In [ ]:
energy.reset_index(inplace=True)

In [ ]:
energy.loc[energy['Country']=='South Korea']

         Country Energy Supply  ...  % Renewable  Unnamed: 6
164  South Korea   11007000000  ...     2.279353         NaN

[1 rows x 5 columns]

In [ ]:
energy.set_index('Country',inplace=True)

#### Step Removing Parenthesis from "Country" like: 
'Bolivia (Plurinational State of)'

##### Take help at https://regex101.com/ 

---

In [ ]:
energy[energy.index=='Bolivia (Plurinational State of)']

                                 Energy Supply  ...  Unnamed: 6
Country                                         ...
Bolivia (Plurinational State of)     336000000  ...         NaN

[1 rows x 4 columns]

#### Case-1: If country is not in index then its easy to use Regex.
First remove country from index

In [ ]:
energy.reset_index(inplace=True)

In [ ]:
#dont forget to give space ,' '
energy['Country']=energy['Country'].str.replace(r'\(.*\)',' ')

In [ ]:
energy['Country']=energy['Country'].str.strip()

In [ ]:
energy[energy['Country']=='Bolivia']

    Country Energy Supply  Energy Supply per Capita  % Renewable  Unnamed: 6
24  Bolivia     336000000                      32.0     31.47712         NaN

In [ ]:
energy[energy['Country']=='Bolivia (Plurinational State of)']

Empty DataFrame
Columns: [Country, Energy Supply, Energy Supply per Capita, % Renewable, Unnamed: 6]
Index: []

#### Now remove the digits

In [ ]:
energy[energy['Country']=='Switzerland17']

           Country Energy Supply  ...  % Renewable  Unnamed: 6
197  Switzerland17    1113000000  ...     57.74548         NaN

[1 rows x 5 columns]

In [ ]:
# first find the digits in the entries
mask = energy[['Country']].apply(
    lambda x: x.str.contains(
        r'Switzerland',
        regex=True
    )
).any(axis=1)

In [ ]:
print (energy[mask])

           Country Energy Supply  ...  % Renewable  Unnamed: 6
197  Switzerland17    1113000000  ...     57.74548         NaN

[1 rows x 5 columns]

In [ ]:
energy['Country']=energy['Country'].str.replace(r'\d+','')

In [ ]:
energy[energy['Country']=='Switzerland17']

Empty DataFrame
Columns: [Country, Energy Supply, Energy Supply per Capita, % Renewable, Unnamed: 6]
Index: []

In [ ]:
energy[energy['Country']=='Switzerland']

         Country Energy Supply  ...  % Renewable  Unnamed: 6
197  Switzerland    1113000000  ...     57.74548         NaN

[1 rows x 5 columns]

In [ ]:
energy.set_index('Country',inplace=True)

# GDP

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
GDPc='/content/drive/My Drive/Coursera Michigan Python/world_bank.csv'

In [ ]:
pd.read_csv(GDPc).head(5)

         Data Source World Development Indicators  ... Unnamed: 62 Unnamed: 63
0                NaN                          NaN  ...         NaN         NaN
1  Last Updated Date                     7/1/2020  ...         NaN         NaN
2                NaN                          NaN  ...         NaN         NaN
3       Country Name                 Country Code  ...      2018.0      2019.0
4              Aruba                          ABW  ...         NaN         NaN

[5 rows x 64 columns]

In [ ]:
# Remove the first 4 rows
pd.read_csv(GDPc,skiprows=4).head()

  Country Name Country Code  ...          2018          2019
0        Aruba          ABW  ...           NaN           NaN
1  Afghanistan          AFG  ...  1.948438e+10  1.910135e+10
2       Angola          AGO  ...  1.013530e+11  9.463542e+10
3      Albania          ALB  ...  1.514702e+10  1.527808e+10
4      Andorra          AND  ...  3.218316e+09  3.154058e+09

[5 rows x 64 columns]

In [ ]:
GDP=pd.read_csv(GDPc,skiprows=4)

##### Note Country is not in Index here

In [ ]:
GDP.index

RangeIndex(start=0, stop=264, step=1)

In [ ]:
energy.index

Index(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Anguilla', 'Antigua and Barbuda', 'Argentina', 'Armenia',
       ...
       'United States Virgin Islands', 'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela', 'Viet Nam', 'Wallis and Futuna Islands', 'Yemen', 'Zambia',
       'Zimbabwe'],
      dtype='object', name='Country', length=227)

#### Rename the countries with new names
"Korea, Rep.": "South Korea", 
"Iran, Islamic Rep.": "Iran",
"Hong Kong SAR, China": "Hong Kong"

In [ ]:
rows_dict_GDP={"Korea, Rep.": "South Korea", 
"Iran, Islamic Rep.": "Iran",
"Hong Kong SAR, China": "Hong Kong"}

#### Rename only works if its an index

In [ ]:
GDP.set_index('Country Name',inplace=True)

In [ ]:
GDP.rename(mapper=rows_dict_GDP,axis=0,inplace=True)

In [ ]:
#checking
#GDP.loc[GDP['Country Name']=='Hong Kong SAR, China']
GDP[GDP.index=='Hong Kong']

             Country Code     Indicator Name  ...          2018          2019
Country Name                                  ...
Hong Kong             HKG  GDP (current US$)  ...  3.616930e+11  3.660300e+11

[1 rows x 63 columns]

### Keep only 2006 to 2016 in the GDP
#### Use GDP[np.append(,)]

In [ ]:
year_to_keep=np.arange(2006,2016).astype(str)
year_to_keep

array(['2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015'], dtype='<U21')

In [ ]:
GDP.index

Index(['Aruba', 'Afghanistan', 'Angola', 'Albania', 'Andorra', 'Arab World',
       'United Arab Emirates', 'Argentina', 'Armenia', 'American Samoa',
       ...
       'Virgin Islands (U.S.)', 'Vietnam', 'Vanuatu', 'World', 'Samoa',
       'Kosovo', 'Yemen, Rep.', 'South Africa', 'Zambia', 'Zimbabwe'],
      dtype='object', name='Country Name', length=264)

In [ ]:
GDP.head(3)

             Country Code     Indicator Name  ...          2018          2019
Country Name                                  ...
Aruba                 ABW  GDP (current US$)  ...           NaN           NaN
Afghanistan           AFG  GDP (current US$)  ...  1.948438e+10  1.910135e+10
Angola                AGO  GDP (current US$)  ...  1.013530e+11  9.463542e+10

[3 rows x 63 columns]

In [ ]:
GDP.reset_index(inplace=True)

In [ ]:
#Note dont use GDP again inside []

years_to_keep = np.arange(2006, 2016).astype(str)
GDP = GDP[np.append('Country Name',years_to_keep)]

In [ ]:
GDP.head()

  Country Name          2006  ...          2014          2015
0        Aruba  2.424581e+09  ...  2.765363e+09  2.919553e+09
1  Afghanistan  6.971286e+09  ...  2.048489e+10  1.990711e+10
2       Angola  5.238101e+10  ...  1.457120e+11  1.161940e+11
3      Albania  8.896074e+09  ...  1.322814e+10  1.138685e+10
4      Andorra  3.456442e+09  ...  3.271808e+09  2.789870e+09

[5 rows x 11 columns]

#### Change Country Name to Country

In [ ]:
 GDP.rename(columns={'Country Name': 'Country'},inplace=True)

In [ ]:
GDP.set_index('Country',inplace=True)

In [ ]:
GDP.head(2)

                     2006          2007  ...          2014          2015
Country                                  ...
Aruba        2.424581e+09  2.615084e+09  ...  2.765363e+09  2.919553e+09
Afghanistan  6.971286e+09  9.747880e+09  ...  2.048489e+10  1.990711e+10

[2 rows x 10 columns]

# ScimEn

In [ ]:
ScimEn='/content/drive/My Drive/Coursera Michigan Python/scimagojr country rank 1996-2019.xlsx'

In [ ]:
ScimEn=pd.read_excel(ScimEn,index_col=None)

In [ ]:
ScimEn.set_index('Country',inplace=True)

# Do the Join 
But, what if the column names are different in the two dataframes? Then, we have to explicitly mention both the column names.

‘left_on’ and ‘right_on’ are two arguments through which we can achieve this. ‘left_on’ is the name of the key in the left dataframe and ‘right_on’ in the right dataframe:

In [ ]:
Newdf = pd.merge(ScimEn,energy,how='outer',left_on='Country',right_on='Country')
Newdf2 = pd.merge(Newdf,GDP,how='outer',left_on='Country',right_on='Country')

In [ ]:
Newdf2 = Newdf2[:15] 
    # Top 15 countries

In [ ]:
Newdf2.head(15)

                    Rank            Region  ...          2014          2015
Country                                     ...
China                1.0    Asiatic Region  ...  1.047570e+13  1.106160e+13
United States        2.0  Northern America  ...  1.752170e+13  1.821930e+13
Japan                3.0    Asiatic Region  ...  4.850410e+12  4.389480e+12
India                4.0    Asiatic Region  ...  2.039130e+12  2.103590e+12
United Kingdom       5.0    Western Europe  ...  3.063800e+12  2.928590e+12
Germany              6.0    Western Europe  ...  3.883920e+12  3.360550e+12
Russian Federation   7.0    Eastern Europe  ...  2.059240e+12  1.363480e+12
Canada               8.0  Northern America  ...  1.803530e+12  1.556130e+12
Italy                9.0    Western Europe  ...  2.159130e+12  1.835900e+12
South Korea         10.0    Asiatic Region  ...  1.484320e+12  1.465770e+12
France              11.0    Western Europe  ...  2.852170e+12  2.438210e+12
Iran                12.0       Middle East  ...  4.326870e+11  3.849510e+11
Spain               13.0    Western Europe  ...  1.369400e+12  1.195120e+12
Australia           14.0    Pacific Region  ...  1.467480e+12  1.351690e+12
Brazil              15.0     Latin America  ...  2.455990e+12  1.802210e+12

[15 rows x 22 columns]

# All combines in a single function

In [ ]:
def answer_one():
    import pandas as pd
    import numpy as np
    Energy_inidactor_xls='/content/drive/My Drive/Coursera Michigan Python/Energy Indicators.xlsx'
    energy = pd.read_excel(Energy_inidactor_xls,skiprows=17,skipfooter=38) # Skip header and footer
    # drop columns
    energy.drop(columns=['Unnamed: 0','Unnamed: 1'],axis=1,inplace=True)
    # Rename columns
    columns_dict={"Unnamed: 2": "Country", "Petajoules": "Energy Supply", "Gigajoules": "Energy Supply per Capita","%" : "% Renewable"}
    energy.rename(mapper=columns_dict,axis=1,inplace=True)
    #Change ['Energy Supply'] to Gigajoules
    energy['Energy Supply'] *= 1000000
    # dropna
    energy.dropna()
    for col in energy:
      energy[col] = energy[col].replace('...',np.nan)
    # to rename rows, change the corresponding column 'Country' to index
    energy.set_index('Country',inplace=True)
    rows_dict={"Republic of Korea": "South Korea", "United States of America": "United States", "United Kingdom of Great Britain and Northern Ireland": "United Kingdom", "China, Hong Kong Special Administrative Region": "Hong Kong"}
    energy.rename(mapper=rows_dict,axis=0,inplace=True)
    # to remove parnethesis and digits and spaces..first remove "Country" from index
    energy.reset_index(inplace=True)
    #dont forget to give space ,' '
    energy['Country']=energy['Country'].str.replace(r'\(.*\)',' ')
    energy['Country']=energy['Country'].str.replace(r'\d+','')
    # remove spaces
    energy['Country']=energy['Country'].str.strip()
    # GDP
    world_bank_csv='/content/drive/My Drive/Coursera Michigan Python/world_bank.csv'
    GDP = pd.read_csv(world_bank_csv, skiprows=4) 
    # Rename the countries with new names
    rows_dict_GDP={"Korea, Rep.": "South Korea","Iran, Islamic Rep.": "Iran","Hong Kong SAR, China": "Hong Kong"}
    # Rename only works if its an index
    GDP.set_index('Country Name',inplace=True)
    GDP.rename(mapper=rows_dict_GDP,axis=0,inplace=True)
    #Keep only 2006 to 2016 in the GDP
    years_to_keep=np.arange(2006,2016).astype(str)
    # To use np.append we need to convert Country_name from index to column
    GDP.reset_index(inplace=True)
    GDP = GDP[np.append('Country Name',years_to_keep)]
    # rename the column .Here also the Country Name should not be index
    GDP.rename(columns={'Country Name': 'Country'},inplace=True)
    GDP.set_index('Country',inplace=True)

    #ScimEn data
    scimagojr_3_xlsx='/content/drive/My Drive/Coursera Michigan Python/scimagojr country rank 1996-2019.xlsx'
    ScimEn=pd.read_excel(scimagojr_3_xlsx,index_col=None)
    # set country to index
    ScimEn.set_index('Country',inplace=True)
    # START THE JOINS
    Newdf = pd.merge(ScimEn,energy,how='outer',left_on='Country',right_on='Country')
    Newdf2 = pd.merge(Newdf,GDP,how='outer',left_on='Country',right_on='Country') 
    Newdf3 = Newdf2[:15]
    Newdf4=Newdf3[['Country','Rank', 'Documents', 'Citable documents', 'Citations', 'Self-citations', 'Citations per document', 'H index', 'Energy Supply', 'Energy Supply per Capita', '% Renewable', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015']]
    Newdf4 = Newdf4.set_index('Country')

    return Newdf4
answer_one()

                    Rank  Documents  ...          2014          2015
Country                              ...
China                1.0   235126.0  ...  1.047570e+13  1.106160e+13
United States        2.0   157811.0  ...  1.752170e+13  1.821930e+13
Japan                3.0    46032.0  ...  4.850410e+12  4.389480e+12
India                4.0    39893.0  ...  2.039130e+12  2.103590e+12
United Kingdom       5.0    38873.0  ...  3.063800e+12  2.928590e+12
Germany              6.0    32935.0  ...  3.883920e+12  3.360550e+12
Russian Federation   7.0    31880.0  ...  2.059240e+12  1.363480e+12
Canada               8.0    29633.0  ...  1.803530e+12  1.556130e+12
Italy                9.0    23725.0  ...  2.159130e+12  1.835900e+12
South Korea         10.0    23451.0  ...  1.484320e+12  1.465770e+12
France              11.0    22429.0  ...  2.852170e+12  2.438210e+12
Iran                12.0    19371.0  ...  4.326870e+11  3.849510e+11
Spain               13.0    18882.0  ...  1.369400e+12  1.195120e+12
Australia           14.0    18077.0  ...  1.467480e+12  1.351690e+12
Brazil              15.0    18024.0  ...  2.455990e+12  1.802210e+12

[15 rows x 20 columns]

In [ ]:
answer_one().shape

(15, 20)

# Question 2

Question 2 (6.6%)

The previous question joined three datasets then reduced this to just the top 15 entries. When you joined the datasets, but before you reduced this to the top 15 items, how many entries did you lose?

This function should return a single number.

### Just the Union of all 3 subtracted by the intersections
Note: Union is OUTER JOIN and Intersections is INNER JOIN

In [ ]:
def answer_two():
    import pandas as pd
    import numpy as np
    Energy_inidactor_xls='/content/drive/My Drive/Coursera Michigan Python/Energy Indicators.xlsx'
    energy = pd.read_excel(Energy_inidactor_xls,skiprows=17,skipfooter=38) # Skip header and footer
    # drop columns
    energy.drop(columns=['Unnamed: 0','Unnamed: 1'],axis=1,inplace=True)
    # Rename columns
    columns_dict={"Unnamed: 2": "Country", "Petajoules": "Energy Supply", "Gigajoules": "Energy Supply per Capita","%" : "% Renewable"}
    energy.rename(mapper=columns_dict,axis=1,inplace=True)
    #Change ['Energy Supply'] to Gigajoules
    energy['Energy Supply'] *= 1000000
    # dropna
    energy.dropna()
    for col in energy:
      energy[col] = energy[col].replace('...',np.nan)
    # to rename rows, change the corresponding column 'Country' to index
    energy.set_index('Country',inplace=True)
    rows_dict={"Republic of Korea": "South Korea", "United States of America": "United States", "United Kingdom of Great Britain and Northern Ireland": "United Kingdom", "China, Hong Kong Special Administrative Region": "Hong Kong"}
    energy.rename(mapper=rows_dict,axis=0,inplace=True)
    # to remove parnethesis and digits and spaces..first remove "Country" from index
    energy.reset_index(inplace=True)
    #dont forget to give space ,' '
    energy['Country']=energy['Country'].str.replace(r'\(.*\)',' ')
    energy['Country']=energy['Country'].str.replace(r'\d+','')
    # remove spaces
    energy['Country']=energy['Country'].str.strip()
    # GDP
    world_bank_csv='/content/drive/My Drive/Coursera Michigan Python/world_bank.csv'
    GDP = pd.read_csv(world_bank_csv, skiprows=4) 
    # Rename the countries with new names
    rows_dict_GDP={"Korea, Rep.": "South Korea","Iran, Islamic Rep.": "Iran","Hong Kong SAR, China": "Hong Kong"}
    # Rename only works if its an index
    GDP.set_index('Country Name',inplace=True)
    GDP.rename(mapper=rows_dict_GDP,axis=0,inplace=True)
    #Keep only 2006 to 2016 in the GDP
    years_to_keep=np.arange(2006,2016).astype(str)
    # To use np.append we need to convert Country_name from index to column
    GDP.reset_index(inplace=True)
    GDP = GDP[np.append('Country Name',years_to_keep)]
    # rename the column .Here also the Country Name should not be index
    GDP.rename(columns={'Country Name': 'Country'},inplace=True)
    GDP.set_index('Country',inplace=True)

    #ScimEn data
    scimagojr_3_xlsx='/content/drive/My Drive/Coursera Michigan Python/scimagojr country rank 1996-2019.xlsx'
    ScimEn=pd.read_excel(scimagojr_3_xlsx,index_col=None)
    # set country to index
    ScimEn.set_index('Country',inplace=True)
    # START THE JOINS
    union = pd.merge(pd.merge(energy, GDP, on='Country', how='outer'), ScimEn, on='Country', how='outer')
    intersection = pd.merge(pd.merge(energy, GDP, on='Country',how='inner'), ScimEn, on='Country',how='inner')
    # if we dont mention how=' ' ,Then its by defualt inner
    intersection = pd.merge(pd.merge(energy, GDP, on='Country'), ScimEn, on='Country')
    return len(union) - len(intersection)

answer_two()

156

# Q 3 . Avereage GDP in last 10 years (for each country)

we take mean of the last ten years

In [ ]:
top_15=answer_one()

In [ ]:
top_15.head(2)

               Rank  Documents  ...          2014          2015
Country                         ...
China           1.0   235126.0  ...  1.047570e+13  1.106160e+13
United States   2.0   157811.0  ...  1.752170e+13  1.821930e+13

[2 rows x 20 columns]

In [ ]:
top_15.columns

Index(['Rank', 'Documents', 'Citable documents', 'Citations', 'Self-citations',
       'Citations per document', 'H index', 'Energy Supply',
       'Energy Supply per Capita', '% Renewable', '2006', '2007', '2008',
       '2009', '2010', '2011', '2012', '2013', '2014', '2015'],
      dtype='object')

In [ ]:
# we only need the last 10 columns
top_15_10=top_15.iloc[:,10:]

In [ ]:
top_15_10.columns

Index(['2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014',
       '2015'],
      dtype='object')

In [ ]:
# just take the mean using axis=1
top_15_10.mean(axis=1)

Country
China                 6.927708e+12
United States         1.566857e+13
Japan                 5.177131e+12
India                 1.602354e+12
United Kingdom        2.776606e+12
Germany               3.518656e+12
Russian Federation    1.666747e+12
Canada                1.613835e+12
Italy                 2.139775e+12
South Korea           1.221372e+12
France                2.687371e+12
Iran                  4.389286e+11
Spain                 1.398586e+12
Australia             1.206525e+12
Brazil                1.988883e+12
dtype: float64

In [ ]:
#also sort it
top_15_10.mean(axis=1).sort_values(ascending=False)

Country
United States         1.566857e+13
China                 6.927708e+12
Japan                 5.177131e+12
Germany               3.518656e+12
United Kingdom        2.776606e+12
France                2.687371e+12
Italy                 2.139775e+12
Brazil                1.988883e+12
Russian Federation    1.666747e+12
Canada                1.613835e+12
India                 1.602354e+12
Spain                 1.398586e+12
South Korea           1.221372e+12
Australia             1.206525e+12
Iran                  4.389286e+11
dtype: float64

In [ ]:
# the last 10 years...all rows but the 1st ten columns
top_15.columns

Index(['Rank', 'Documents', 'Citable documents', 'Citations', 'Self-citations',
       'Citations per document', 'H index', 'Energy Supply',
       'Energy Supply per Capita', '% Renewable', '2006', '2007', '2008',
       '2009', '2010', '2011', '2012', '2013', '2014', '2015'],
      dtype='object')

In [ ]:
def answer_three():
    import pandas as pd
    Top15 = answer_one()
    Top15 = Top15.iloc[:,10:] 
    # Only include the years for columns
    avgGDP = Top15.mean(axis=1)
    return avgGDP.sort_values(ascending=False)

answer_three()

Country
United States         1.566857e+13
China                 6.927708e+12
Japan                 5.177131e+12
Germany               3.518656e+12
United Kingdom        2.776606e+12
France                2.687371e+12
Italy                 2.139775e+12
Brazil                1.988883e+12
Russian Federation    1.666747e+12
Canada                1.613835e+12
India                 1.602354e+12
Spain                 1.398586e+12
South Korea           1.221372e+12
Australia             1.206525e+12
Iran                  4.389286e+11
dtype: float64

In [ ]:
answer_three().index

Index(['United States', 'China', 'Japan', 'Germany', 'United Kingdom',
       'France', 'Italy', 'Brazil', 'Russian Federation', 'Canada', 'India',
       'Spain', 'South Korea', 'Australia', 'Iran'],
      dtype='object', name='Country')

# Question 4

By how much had the GDP changed over the 10 year span for the country with the 6th largest average GDP?

In [ ]:
# the top 10 average countries are
Top_10_avg=answer_three()
Top_10_avg

Country
United States         1.566857e+13
China                 6.927708e+12
Japan                 5.177131e+12
Germany               3.518656e+12
United Kingdom        2.776606e+12
France                2.687371e+12
Italy                 2.139775e+12
Brazil                1.988883e+12
Russian Federation    1.666747e+12
Canada                1.613835e+12
India                 1.602354e+12
Spain                 1.398586e+12
South Korea           1.221372e+12
Australia             1.206525e+12
Iran                  4.389286e+11
dtype: float64

In [ ]:
# We see its France at 5th index
Top_10_avg.index[5]

'France'

In [ ]:
# we have top 15
Top_15=answer_one()

In [ ]:
Top_15.loc["France"]['2015']

2438210000000.0

In [ ]:
def answer_four():
    Top15 = answer_one()
    SixAverage = answer_three().index[5] # i.e France
    
    return (Top15.loc[SixAverage]['2015'] - Top15.loc[SixAverage]['2006'])
answer_four()

119620000000.0

In [ ]:
def answer_four():
    Top15 = answer_one()
    avgGDP = answer_three()
    idx = avgGDP.index[5]
    return (Top15.loc[idx]['2015'] - Top15.loc[idx]['2006'])
answer_four()

119620000000.0

# Question 5

What is the mean Energy Supply per Capita?

In [ ]:
Top_15.head()

                Rank  Documents  ...          2014          2015
Country                          ...
China            1.0   235126.0  ...  1.047570e+13  1.106160e+13
United States    2.0   157811.0  ...  1.752170e+13  1.821930e+13
Japan            3.0    46032.0  ...  4.850410e+12  4.389480e+12
India            4.0    39893.0  ...  2.039130e+12  2.103590e+12
United Kingdom   5.0    38873.0  ...  3.063800e+12  2.928590e+12

[5 rows x 20 columns]

In [ ]:
Top_15['Energy Supply per Capita'].mean()
#Top15.mean(axis=1)

In [ ]:
def answer_five():
    Top15 = answer_one()
    return Top15['Energy Supply per Capita'].mean()
answer_five()

150.30769230769232

# Question 6

What country has the maximum % Renewable and what is the percentage?

In [ ]:
Top_15.head(2)

               Rank  Documents  ...          2014          2015
Country                         ...
China           1.0   235126.0  ...  1.047570e+13  1.106160e+13
United States   2.0   157811.0  ...  1.752170e+13  1.821930e+13

[2 rows x 20 columns]

In [ ]:
Top_15['% Renewable'].max()

69.64803

In [ ]:
Top_15['% Renewable'].idxmax()

'Brazil'

In [ ]:
def answer_six():
    Top15 = answer_one()
    return (Top15['% Renewable'].idxmax(), Top15['% Renewable'].max())
answer_six()

('Brazil', 69.64803)

# Question 7

Create a new column that is the ratio of ## 'Self-Citations' to 'Citations'.
 What is the maximum value for this new column, and what country has the highest ratio?

In [ ]:
Top_15['Ratio']=Top_15['Self-citations']/Top_15['Citations']

In [ ]:
Top_15.head(3)

               Rank  Documents  ...          2015     Ratio
Country                         ...
China           1.0   235126.0  ...  1.106160e+13  0.684142
United States   2.0   157811.0  ...  1.821930e+13  0.329464
Japan           3.0    46032.0  ...  4.389480e+12  0.251665

[3 rows x 21 columns]